driver-tests/pojose/asynch/InOuts/caTstAsynchInOut/src/jbiasa/caTstAsynchInOut.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="caTstAsynchInOut"
             xmlns:tns="caTstAsynchInOut" xmlns:ns="http://inouts.asynch.tst.sun.com/ASynchInOutSvc/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://inouts.asynch.tst.sun.com/ASynchInOutSvc/" location="../jbiServiceUnits/jseASynchInOut/com/sun/tst/asynch/inouts/ASynchInOutSvc.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:ASynchInOutSvcInterface">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="ASynchInOutSvcOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="caTstAsynchInOut"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="caTstAsynchInOut"/>
            </output>
        </operation>
    </binding>
    <service name="casaService1">
        <port name="httpTstPojoAsynch" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/casaService1/httpTstPojoAsynch"/>
        </port>
    </service>
</definitions>
