driver-tests/pojose/asynch/InOuts/caTstAsynchInOut/test/tstPOJOAsynchCalls/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cat="caTstAsynchInOut">
  <soapenv:Body>
    <cat:ASynchInOutSvcOperation>
      <part1>100</part1>
    </cat:ASynchInOutSvcOperation>
  </soapenv:Body>
</soapenv:Envelope>